enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
/*
 ******************************************************************************
 * @file    lis2de12_reg.c
 * @author  Sensors Software Solution Team
 * @brief   LIS2DE12 driver file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2018 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright
 *      notice, this list of conditions and the following disclaimer in the
 *      documentation and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its
 *      contributors may be used to endorse or promote products derived from
 *      this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "lis2de12.h"
#include "stm32wlxx_hal.h"
// #include "lr1110_modem_board.h"

//#include "smtc_hal_gpio.h"
//#include "smtc_hal_i2c.h"
#include <string.h>

//#include "smtc_hal_dbg_trace.h"

/***************************************************************************\
 * RAM data
\***************************************************************************/

// The I2C instance of the LIS2DE12.
extern I2C_HandleTypeDef hi2c3;

static bool accelerometer_irq1_state = false;

static uint8_t who_am_i;
axis3bit16_t   data_raw_acceleration;
float          acceleration_mg[3];

static void accelerometer_irq1_init( void );

/*!
 * @brief INT1 interrupt callback
 */
void lis2de12_int1_irq_handler( void* obj );

/*!
 * Hardware IRQ INT1 callback initialization
 */
//static hal_gpio_irq_t lis2de12_int1 = {
//    .pin      = PA_9,           //ACC_INT1,
//    .callback = lis2de12_int1_irq_handler,
//    .context  = NULL,
//};

/**
 * @defgroup  LIS2DE12
 * @brief     This file provides a set of functions needed to drive the
 *            lis2de12 enanced inertial module.
 * @{
 *
 */

/**
 * @defgroup  LIS2DE12_Interfaces_Functions
 * @brief     This section provide a set of functions used to read and
 *            write a generic register of the device.
 *            MANDATORY: return 0 -> no Error.
 * @{
 *
 */

void initLIS2DE12_temperature( ) {
    /* Enable temperature sensor */
    if (lis2de12_temperature_meas_set(LIS2DE12_TEMP_ENABLE) != 0) {
//        SMTC_HAL_TRACE_ERROR( "LIS2DE12 Temperature sensor enable failed\r\n" );
        return;
    }

    /* Enable Block Data Update */
    if (lis2de12_block_data_update_set( PROPERTY_ENABLE ) != 0) {
//        SMTC_HAL_TRACE_ERROR( "LIS2DE12 Block Data Update enable failed\r\n" );
        return;
    }
}

/*!
 * @brief Initializes the hardware and variables associated with the lis2de12.
 *
 * @returns      Status        SUCCESS(1) or FAIL(0)
 */
uint8_t accelerometer_init( ) {

    /* Check device ID */
    int i = 0;
    while( ( i <= 5 ) && ( who_am_i != LIS2DE12_ID ) ) {
        if (lis2de12_device_id_get( &who_am_i ) != 0) {
//            SMTC_HAL_TRACE_WARNING( "LIS2DE12 Device ID read failed\r\n" );
        }
        if( who_am_i != LIS2DE12_ID ) {
            if( i == 5 ) {
//                SMTC_HAL_TRACE_ERROR( "LIS2DE12 Device ID read failed after %d attempts\r\n", i );
                return 0;
            }
        }
        i++;
    }
//    SMTC_HAL_TRACE_INFO( "LIS2DE12 Device ID: 0x%02X\r\n", who_am_i );

    // REG1

    /* Set Output Data Rate to 10Hz */
    if (lis2de12_data_rate_set( LIS2DE12_ODR_1Hz ) != 0) {
//        SMTC_HAL_TRACE_ERROR( "LIS2DE12 Data rate set failed\r\n" );
        return 0;
    }

    /* Motion detection setup */
    lis2de12_ctrl_reg1_t ctrl_reg1 = {0};
    lis2de12_read_reg( LIS2DE12_CTRL_REG1, ( uint8_t* ) &ctrl_reg1, 1 );
    ctrl_reg1.lpen = 1;
    ctrl_reg1.xen = 1;
    ctrl_reg1.yen = 1;
    ctrl_reg1.zen = 1;
    lis2de12_write_reg( LIS2DE12_CTRL_REG1, ( uint8_t* ) &ctrl_reg1, 1 );


    // REG2

    /* Set High Pass Filter Mode */
    lis2de12_high_pass_mode_set( LIS2DE12_AUTORST_ON_INT );

    lis2de12_high_pass_bandwidth_set( LIS2DE12_LIGHT );

    /* Set FDS mode */
    lis2de12_high_pass_on_outputs_set( PROPERTY_DISABLE );

    lis2de12_high_pass_int_conf_set( LIS2DE12_ON_INT1_GEN );









    // /* Enable bypass mode */
    // if (lis2de12_fifo_mode_set( LIS2DE12_BYPASS_MODE ) != 0) {
    //     SMTC_HAL_TRACE_ERROR( "LIS2DE12 FIFO mode set failed\r\n" );
    //     return 0;
    // }

    // initLIS2DE12_temperature( );

    // if (lis2de12_fifo_set( PROPERTY_DISABLE ) != 0) {
    //     SMTC_HAL_TRACE_ERROR( "LIS2DE12 FIFO set failed\r\n" );
    //     return 0;
    // }

    /* Set full scale to 2g */
    lis2de12_full_scale_set( LIS2DE12_2g );

    // lis2de12_boot_set( PROPERTY_ENABLE );




    lis2de12_int1_pin_detect_4d_set( PROPERTY_ENABLE );




    uint8_t a = 0;
    lis2de12_filter_reference_set( &a );


    lis2de12_ctrl_reg3_t ctrl_reg3 = {0};
    ctrl_reg3.i1_click    = 0;
    ctrl_reg3.i1_ia1      = 1;
    ctrl_reg3.i1_ia2      = 0;
    ctrl_reg3.i1_zyxda    = 0;
    ctrl_reg3.i1_wtm      = 0;
    ctrl_reg3.i1_overrun  = 0;
    lis2de12_pin_int1_config_set( &ctrl_reg3 );

