enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
    lis2de12_int1_gen_threshold_set( 10 );

    lis2de12_int1_gen_duration_set( 1 ); // [s]



    // lis2de12_int1_pin_notification_mode_set( LIS2DE12_INT1_LATCHED );
    lis2de12_int1_cfg_t lis2de12_int1_cfg = {0};
    lis2de12_int1_cfg.xhie = 0;
    lis2de12_int1_cfg.yhie = 0;
    lis2de12_int1_cfg.zhie = 0;

    lis2de12_int1_cfg.xlie = 1;
    lis2de12_int1_cfg.ylie = 1;
    lis2de12_int1_cfg.zlie = 1;

    lis2de12_int1_cfg._6d  = 0;
    lis2de12_int1_cfg.aoi  = 0;
    lis2de12_int1_gen_conf_set( &lis2de12_int1_cfg );


//    accelerometer_irq1_init( );

    return SUCCESS;
}

uint8_t is_accelerometer_detected_moved( void )
{
    // lis2de12_int1_src_t int1_gen_source;

    accelerometer_irq1_state = false;

    // lis2de12_int1_gen_source_get( &int1_gen_source );

    // if( ( int1_gen_source.xh == 1 ) || ( int1_gen_source.yh == 1 ) || ( int1_gen_source.zh == 1 ) ) {
    //     accelerometer_irq1_state = false;
    //     return 1;
    // }
    return 0;
}

/*!
 * @brief Get the accelerometer IRQ state
 */
bool get_accelerometer_irq1_state( void ) { return accelerometer_irq1_state; }

uint8_t is_accelerometer_double_tap_detected( void )
{
    lis2de12_click_src_t click_src;

    lis2de12_tap_source_get( &click_src );

    if( ( click_src.dclick == 1 ) || ( click_src.ia == 1 ) || ( click_src.z == 1 ) )
    {
        return 1;
    }
    return 0;
}

void acc_read_raw_data( void )
{
    lis2de12_reg_t reg;
    bool           data_read = false;

    while( data_read == false )
    {
        lis2de12_xl_data_ready_get( &reg.byte );
        if( reg.byte )
        {
            /* Read accelerometer data */
            memset( data_raw_acceleration.u8bit, 0x00, 3 * sizeof( int16_t ) );
            lis2de12_acceleration_raw_get( data_raw_acceleration.u8bit );

            lis2de12_acceleration_raw_get_x( data_raw_acceleration.u8bit );
            lis2de12_acceleration_raw_get_y( data_raw_acceleration.u8bit + 2 );
            lis2de12_acceleration_raw_get_z( data_raw_acceleration.u8bit + 4 );

            acceleration_mg[0] = lis2de12_from_fs2_to_mg( data_raw_acceleration.i16bit[0] );
            acceleration_mg[1] = lis2de12_from_fs2_to_mg( data_raw_acceleration.i16bit[1] );
            acceleration_mg[2] = lis2de12_from_fs2_to_mg( data_raw_acceleration.i16bit[2] );

            data_read = true;
        }
    }
}

int16_t acc_get_raw_x( void ) { return acceleration_mg[0]; }

int16_t acc_get_raw_y( void ) { return acceleration_mg[1]; }

int16_t acc_get_raw_z( void ) { return acceleration_mg[2]; }

int16_t acc_get_temperature( void )
{
    uint16_t temperature;
    uint8_t  is_ready = 0;

    lis2de12_temp_data_ready_get( &is_ready );

    if ( is_ready ) {
        lis2de12_temperature_raw_get( &temperature );
    }

    temperature = (temperature / 256.0) + 25.0;

    /* Build the raw tmp */
    return ( int16_t ) temperature;
}

/**
 * @brief  Read generic device register
 *
 * @param  reg   register to read
 * @param  data  pointer to buffer that store the data read(ptr)
 * @param  len   number of consecutive register to read
 * @retval          interface status (MANDATORY: return 0 -> no Error)
 *
 */
int32_t lis2de12_read_reg( uint8_t reg, uint8_t* data, uint16_t len )
{
    int32_t ret;
    ret = hal_i2c_read_buffer( 1, LIS2DE12_I2C_ADD_H, reg, data, len );
    return ret;
}

/**
 * @brief  Write generic device register
 *
 * @param  reg   register to write
 * @param  data  pointer to data to write in register reg(ptr)
 * @param  len   number of consecutive register to write
 * @retval          interface status (MANDATORY: return 0 -> no Error)
 *
 */
int32_t lis2de12_write_reg( uint8_t reg, uint8_t* data, uint16_t len )
{
    int32_t ret;
    ret = hal_i2c_write_buffer( 1, LIS2DE12_I2C_ADD_H, reg, data, len );
    return ret;
}

/**
 * @}
 *
 */

/**
 * @defgroup    LIS2DE12_Sensitivity
 * @brief       These functions convert raw-data into engineering units.
 * @{
 *
 */

float_t lis2de12_from_fs2_to_mg( int16_t lsb ) { return ( ( float_t ) lsb / 256.0f ) * 16.0f; }

float_t lis2de12_from_fs4_to_mg( int16_t lsb ) { return ( ( float_t ) lsb / 256.0f ) * 32.0f; }

float_t lis2de12_from_fs8_to_mg( int16_t lsb ) { return ( ( float_t ) lsb / 256.0f ) * 64.0f; }

float_t lis2de12_from_fs16_to_mg( int16_t lsb ) { return ( ( float_t ) lsb / 256.0f ) * 192.0f; }

float_t lis2de12_from_lsb_to_celsius( int16_t lsb ) { return ( ( ( float_t ) lsb / 256.0f ) * 1.0f ) + 25.0f; }

/**
 * @}
 *
 */

/**
 * @defgroup  LIS2DE12_Data_generation
 * @brief     This section group all the functions concerning data generation.
 * @{
 *
 */

/**
  * @brief  Temperature status register.[get]
  *

  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_temp_status_reg_get( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_STATUS_REG_AUX, buff, 1 );
    return ret;
}
/**
  * @brief  Temperature data available.[get]
  *

  * @param  val      change the values of tda in reg STATUS_REG_AUX
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_temp_data_ready_get( uint8_t* val )
{
    lis2de12_status_reg_aux_t status_reg_aux;
    int32_t                   ret;

    ret  = lis2de12_read_reg( LIS2DE12_STATUS_REG_AUX, ( uint8_t* ) &status_reg_aux, 1 );
    *val = status_reg_aux.tda;

    return ret;
}
/**
  * @brief  Temperature data overrun.[get]
  *

  * @param  val      change the values of tor in reg STATUS_REG_AUX
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_temp_data_ovr_get( uint8_t* val )
{
    lis2de12_status_reg_aux_t status_reg_aux;
    int32_t                   ret;

    ret  = lis2de12_read_reg( LIS2DE12_STATUS_REG_AUX, ( uint8_t* ) &status_reg_aux, 1 );
    *val = status_reg_aux.tor;

    return ret;
}
/**
  * @brief  Temperature output value.[get]
  *

  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_temperature_raw_get( uint16_t* raw_temp )
{
    int32_t ret;
    uint8_t buf_tmp;

    ret       = lis2de12_read_reg( LIS2DE12_OUT_TEMP_L, &buf_tmp, 1 );
    *raw_temp = buf_tmp;

    ret = lis2de12_read_reg( LIS2DE12_OUT_TEMP_H, &buf_tmp, 1 );
    *raw_temp += buf_tmp << 8;

    return ret;
}
/**
  * @brief  Temperature sensor enable.[set]
  *

  * @param  val      change the values of temp_en in reg TEMP_CFG_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_temperature_meas_set( lis2de12_temp_en_t val )
{
    lis2de12_temp_cfg_reg_t temp_cfg_reg;
    int32_t                 ret;

    ret = lis2de12_read_reg( LIS2DE12_TEMP_CFG_REG, ( uint8_t* ) &temp_cfg_reg, 1 );
    if( ret == 0 )
    {
        temp_cfg_reg.temp_en = ( uint8_t ) val;
        ret                  = lis2de12_write_reg( LIS2DE12_TEMP_CFG_REG, ( uint8_t* ) &temp_cfg_reg, 1 );
    }
    return ret;
}

/**
  * @brief  Temperature sensor enable.[get]
  *

  * @param  val      get the values of temp_en in reg TEMP_CFG_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_temperature_meas_get( lis2de12_temp_en_t* val )
{
    lis2de12_temp_cfg_reg_t temp_cfg_reg;
    int32_t                 ret;

    ret = lis2de12_read_reg( LIS2DE12_TEMP_CFG_REG, ( uint8_t* ) &temp_cfg_reg, 1 );
    switch( temp_cfg_reg.temp_en )
    {
    case LIS2DE12_TEMP_DISABLE:
        *val = LIS2DE12_TEMP_DISABLE;
        break;
    case LIS2DE12_TEMP_ENABLE:
        *val = LIS2DE12_TEMP_ENABLE;
        break;
    default:
        *val = LIS2DE12_TEMP_DISABLE;
        break;
    }
    return ret;
}

/**
  * @brief  Output data rate selection.[set]
  *

  * @param  val      change the values of odr in reg CTRL_REG1
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_data_rate_set( lis2de12_odr_t val )
{
    lis2de12_ctrl_reg1_t ctrl_reg1;
    volatile int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG1, ( uint8_t* ) &ctrl_reg1, 1 );
    if( ret == 0 )
    {
        ctrl_reg1.lpen = PROPERTY_ENABLE;
        ctrl_reg1.odr  = ( uint8_t ) val;
        ret            = lis2de12_write_reg( LIS2DE12_CTRL_REG1, ( uint8_t* ) &ctrl_reg1, 1 );
    }
    return ret;
}

/**
  * @brief  Output data rate selection.[get]
  *

  * @param  val      get the values of odr in reg CTRL_REG1
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_data_rate_get( lis2de12_odr_t* val )
{
    lis2de12_ctrl_reg1_t ctrl_reg1;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG1, ( uint8_t* ) &ctrl_reg1, 1 );
    switch( ctrl_reg1.odr )
    {
    case LIS2DE12_POWER_DOWN:
        *val = LIS2DE12_POWER_DOWN;
        break;
    case LIS2DE12_ODR_1Hz:
        *val = LIS2DE12_ODR_1Hz;
        break;
    case LIS2DE12_ODR_10Hz:
        *val = LIS2DE12_ODR_10Hz;
        break;
    case LIS2DE12_ODR_25Hz:
        *val = LIS2DE12_ODR_25Hz;
        break;
    case LIS2DE12_ODR_50Hz:
        *val = LIS2DE12_ODR_50Hz;
        break;
    case LIS2DE12_ODR_100Hz:
        *val = LIS2DE12_ODR_100Hz;
        break;
    case LIS2DE12_ODR_200Hz:
        *val = LIS2DE12_ODR_200Hz;
        break;
    case LIS2DE12_ODR_400Hz:
        *val = LIS2DE12_ODR_400Hz;
        break;
    case LIS2DE12_ODR_1kHz620_LP:
        *val = LIS2DE12_ODR_1kHz620_LP;
        break;
    case LIS2DE12_ODR_5kHz376_LP_1kHz344_NM_HP:
        *val = LIS2DE12_ODR_5kHz376_LP_1kHz344_NM_HP;
        break;
    default:
        *val = LIS2DE12_POWER_DOWN;
        break;
    }
    return ret;
}

/**
  * @brief   High pass data from internal filter sent to output register
  *          and FIFO.
  *

  * @param  val      change the values of fds in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_on_outputs_set( uint8_t val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

