enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    if( ret == 0 )
    {
        ctrl_reg2.fds = val;
        ret           = lis2de12_write_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    }
    return ret;
}

/**
  * @brief   High pass data from internal filter sent to output register
  *          and FIFO.[get]
  *

  * @param  val      change the values of fds in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_on_outputs_get( uint8_t* val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

    ret  = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    *val = ( uint8_t ) ctrl_reg2.fds;

    return ret;
}

/**
  * @brief   High-pass filter cutoff frequency selection.[set]
  *
  * HPCF[2:1]\ft @1Hz    @10Hz  @25Hz  @50Hz @100Hz @200Hz @400Hz @1kHz6 ft@5kHz
  * AGGRESSIVE   0.02Hz  0.2Hz  0.5Hz  1Hz   2Hz    4Hz    8Hz    32Hz   100Hz
  * STRONG       0.008Hz 0.08Hz 0.2Hz  0.5Hz 1Hz    2Hz    4Hz    16Hz   50Hz
  * MEDIUM       0.004Hz 0.04Hz 0.1Hz  0.2Hz 0.5Hz  1Hz    2Hz    8Hz    25Hz
  * LIGHT        0.002Hz 0.02Hz 0.05Hz 0.1Hz 0.2Hz  0.5Hz  1Hz    4Hz    12Hz
  *

  * @param  val      change the values of hpcf in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_bandwidth_set( lis2de12_hpcf_t val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    if( ret == 0 )
    {
        ctrl_reg2.hpcf = ( uint8_t ) val;
        ret            = lis2de12_write_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    }
    return ret;
}

/**
  * @brief   High-pass filter cutoff frequency selection.[get]
  *
  * HPCF[2:1]\ft @1Hz    @10Hz  @25Hz  @50Hz @100Hz @200Hz @400Hz @1kHz6 ft@5kHz
  * AGGRESSIVE   0.02Hz  0.2Hz  0.5Hz  1Hz   2Hz    4Hz    8Hz    32Hz   100Hz
  * STRONG       0.008Hz 0.08Hz 0.2Hz  0.5Hz 1Hz    2Hz    4Hz    16Hz   50Hz
  * MEDIUM       0.004Hz 0.04Hz 0.1Hz  0.2Hz 0.5Hz  1Hz    2Hz    8Hz    25Hz
  * LIGHT        0.002Hz 0.02Hz 0.05Hz 0.1Hz 0.2Hz  0.5Hz  1Hz    4Hz    12Hz
  *

  * @param  val      get the values of hpcf in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_bandwidth_get( lis2de12_hpcf_t* val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    switch( ctrl_reg2.hpcf )
    {
    case LIS2DE12_AGGRESSIVE:
        *val = LIS2DE12_AGGRESSIVE;
        break;
    case LIS2DE12_STRONG:
        *val = LIS2DE12_STRONG;
        break;
    case LIS2DE12_MEDIUM:
        *val = LIS2DE12_MEDIUM;
        break;
    case LIS2DE12_LIGHT:
        *val = LIS2DE12_LIGHT;
        break;
    default:
        *val = LIS2DE12_LIGHT;
        break;
    }
    return ret;
}

/**
  * @brief  High-pass filter mode selection.[set]
  *

  * @param  val      change the values of hpm in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_mode_set( lis2de12_hpm_t val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    if( ret == 0 )
    {
        ctrl_reg2.hpm = ( uint8_t ) val;
        ret           = lis2de12_write_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    }
    return ret;
}

/**
  * @brief  High-pass filter mode selection.[get]
  *

  * @param  val      get the values of hpm in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_mode_get( lis2de12_hpm_t* val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    switch( ctrl_reg2.hpm )
    {
    case LIS2DE12_NORMAL_WITH_RST:
        *val = LIS2DE12_NORMAL_WITH_RST;
        break;
    case LIS2DE12_REFERENCE_MODE:
        *val = LIS2DE12_REFERENCE_MODE;
        break;
    case LIS2DE12_NORMAL:
        *val = LIS2DE12_NORMAL;
        break;
    case LIS2DE12_AUTORST_ON_INT:
        *val = LIS2DE12_AUTORST_ON_INT;
        break;
    default:
        *val = LIS2DE12_NORMAL_WITH_RST;
        break;
    }
    return ret;
}

/**
  * @brief  Full-scale configuration.[set]
  *

  * @param  val      change the values of fs in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_full_scale_set( lis2de12_fs_t val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    if( ret == 0 )
    {
        ctrl_reg4.fs = ( uint8_t ) val;
        ret          = lis2de12_write_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    }
    return ret;
}

/**
  * @brief  Full-scale configuration.[get]
  *

  * @param  val      get the values of fs in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_full_scale_get( lis2de12_fs_t* val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    switch( ctrl_reg4.fs )
    {
    case LIS2DE12_2g:
        *val = LIS2DE12_2g;
        break;
    case LIS2DE12_4g:
        *val = LIS2DE12_4g;
        break;
    case LIS2DE12_8g:
        *val = LIS2DE12_8g;
        break;
    case LIS2DE12_16g:
        *val = LIS2DE12_16g;
        break;
    default:
        *val = LIS2DE12_2g;
        break;
    }
    return ret;
}

/**
  * @brief  Block Data Update.[set]
  *
  * Feature that ensures data consistency
  * When BDU is enabled, it ensures that the output data registers are not updated until both the high and low data bytes have been read.
  * This prevents inconsistencies when reading data during a dynamic measurement session.
  * Essentially, it ensures that a set of data is either fully updated or not updated at all, avoiding partial updates that could lead to incorrect readings.

  * @param  val      change the values of bdu in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_block_data_update_set( uint8_t val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    if( ret == 0 )
    {
        ctrl_reg4.bdu = val;
        ret           = lis2de12_write_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    }
    return ret;
}

/**
  * @brief  Block Data Update.[get]
  *

  * @param  val      change the values of bdu in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_block_data_update_get( uint8_t* val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret  = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    *val = ( uint8_t ) ctrl_reg4.bdu;

    return ret;
}

/**
  * @brief  Reference value for interrupt generation.[set]
  *         LSB = ~16@2g / ~31@4g / ~63@8g / ~127@16g
  *

  * @param  buff     buffer that contains data to write
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_filter_reference_set( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_write_reg( LIS2DE12_REFERENCE, buff, 1 );
    return ret;
}

/**
  * @brief  Reference value for interrupt generation.[get]
  *         LSB = ~16@2g / ~31@4g / ~63@8g / ~127@16g
  *

