enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_filter_reference_get( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_REFERENCE, buff, 1 );
    return ret;
}
/**
  * @brief  Acceleration set of data available.[get]
  *

  * @param  val      change the values of zyxda in reg STATUS_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_xl_data_ready_get( uint8_t* val )
{
    lis2de12_status_reg_t status_reg;
    int32_t               ret;

    ret  = lis2de12_read_reg( LIS2DE12_STATUS_REG, ( uint8_t* ) &status_reg, 1 );
    *val = status_reg.zyxda;

    return ret;
}
/**
  * @brief  Acceleration set of data overrun.[get]
  *

  * @param  val      change the values of zyxor in reg STATUS_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_xl_data_ovr_get( uint8_t* val )
{
    lis2de12_status_reg_t status_reg;
    int32_t               ret;

    ret  = lis2de12_read_reg( LIS2DE12_STATUS_REG, ( uint8_t* ) &status_reg, 1 );
    *val = status_reg.zyxor;

    return ret;
}
/**
  * @brief  Acceleration output value.[get]
  *

  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_acceleration_raw_get( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_read_reg( 0x08 | LIS2DE12_FIFO_READ_START, buff, 6 );
    return ret;
}

/**
  * @brief  Acceleration output x value.[get]
  *

  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_acceleration_raw_get_x( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_read_reg( 0x08 | LIS2DE12_OUT_X_H, buff, 2 );
    return ret;
}

/**
  * @brief  Acceleration output y value.[get]
  *

  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_acceleration_raw_get_y( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_read_reg( 0x08 | LIS2DE12_OUT_Y_H, buff, 2 );
    return ret;
}

/**
  * @brief  Acceleration output z value.[get]
  *

  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_acceleration_raw_get_z( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_read_reg( 0x08 | LIS2DE12_OUT_Z_H, buff, 2 );
    return ret;
}
/**
 * @}
 *
 */

/**
 * @defgroup  LIS2DE12_Common
 * @brief     This section group common usefull functions
 * @{
 *
 */

/**
  * @brief  DeviceWhoamI .[get]
  *

  * @param  buff     buffer that stores data read
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_device_id_get( uint8_t* buff )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_WHO_AM_I, buff, 1 );
    return ret;
}
/**
  * @brief  Self Test.[set]
  *

  * @param  val      change the values of st in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_self_test_set( lis2de12_st_t val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    if( ret == 0 )
    {
        ctrl_reg4.st = ( uint8_t ) val;
        ret          = lis2de12_write_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    }
    return ret;
}

/**
  * @brief  Self Test.[get]
  *

  * @param  val      Get the values of st in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_self_test_get( lis2de12_st_t* val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    switch( ctrl_reg4.st )
    {
    case LIS2DE12_ST_DISABLE:
        *val = LIS2DE12_ST_DISABLE;
        break;
    case LIS2DE12_ST_POSITIVE:
        *val = LIS2DE12_ST_POSITIVE;
        break;
    case LIS2DE12_ST_NEGATIVE:
        *val = LIS2DE12_ST_NEGATIVE;
        break;
    default:
        *val = LIS2DE12_ST_DISABLE;
        break;
    }
    return ret;
}

/**
  * @brief  Reboot memory content. Reload the calibration parameters.[set]
  *

  * @param  val      change the values of boot in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_boot_set( uint8_t val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    if( ret == 0 )
    {
        ctrl_reg5.boot = val;
        ret            = lis2de12_write_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    }
    return ret;
}

/**
  * @brief  Reboot memory content. Reload the calibration parameters.[get]
  *

  * @param  val      change the values of boot in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_boot_get( uint8_t* val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret  = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    *val = ( uint8_t ) ctrl_reg5.boot;

    return ret;
}

/**
  * @brief  Info about device status.[get]
  *

  * @param  val      register STATUS_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_status_get( lis2de12_status_reg_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_STATUS_REG, ( uint8_t* ) val, 1 );
    return ret;
}
/**
 * @}
 *
 */

/**
 * @defgroup   LIS2DE12_Interrupts_generator_1
 * @brief      This section group all the functions that manage the first
 *             interrupts generator
 * @{
 *
 */

/**
  * @brief  Interrupt generator 1 configuration register.[set]
  *

  * @param  val      register INT1_CFG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_gen_conf_set( lis2de12_int1_cfg_t* val )
{
    int32_t ret;
    ret = lis2de12_write_reg( LIS2DE12_INT1_CFG, ( uint8_t* ) val, 1 );
    return ret;
}

/**
  * @brief  Interrupt generator 1 configuration register.[get]
  *

  * @param  val      register INT1_CFG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_gen_conf_get( lis2de12_int1_cfg_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_INT1_CFG, ( uint8_t* ) val, 1 );
    return ret;
}

/**
  * @brief  Interrupt generator 1 source register.[get]
  *

  * @param  val      Registers INT1_SRC
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_gen_source_get( lis2de12_int1_src_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_INT1_SRC, ( uint8_t* ) val, 1 );
    return ret;
}
/**
  * @brief  User-defined threshold value for xl interrupt event on
  *         generator 1.[set]
  *         LSb = 16mg@2g / 32mg@4g / 62mg@8g / 186mg@16g
  *

  * @param  val      change the values of ths in reg INT1_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_gen_threshold_set( uint8_t val )
{
    lis2de12_int1_ths_t int1_ths;
    int32_t             ret;

    ret = lis2de12_read_reg( LIS2DE12_INT1_THS, ( uint8_t* ) &int1_ths, 1 );
    if( ret == 0 )
    {
        int1_ths.ths = val;
        ret          = lis2de12_write_reg( LIS2DE12_INT1_THS, ( uint8_t* ) &int1_ths, 1 );
    }
    return ret;
}

/**
  * @brief  User-defined threshold value for xl interrupt event on
  *         generator 1.[get]
  *         LSb = 16mg@2g / 32mg@4g / 62mg@8g / 186mg@16g
  *

  * @param  val      change the values of ths in reg INT1_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_gen_threshold_get( uint8_t* val )
{
    lis2de12_int1_ths_t int1_ths;
    int32_t             ret;

    ret  = lis2de12_read_reg( LIS2DE12_INT1_THS, ( uint8_t* ) &int1_ths, 1 );
    *val = ( uint8_t ) int1_ths.ths;

    return ret;
}

/**
  * @brief  The minimum duration (LSb = 1/ODR) of the Interrupt 1 event to be
  *         recognized.[set]
  *

  * @param  val      change the values of d in reg INT1_DURATION
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_gen_duration_set( uint8_t val )
{
    lis2de12_int1_duration_t int1_duration;
    int32_t                  ret;

    ret = lis2de12_read_reg( LIS2DE12_INT1_DURATION, ( uint8_t* ) &int1_duration, 1 );
    if( ret == 0 )
    {
        int1_duration.d = val;
        ret             = lis2de12_write_reg( LIS2DE12_INT1_DURATION, ( uint8_t* ) &int1_duration, 1 );
    }
    return ret;
}

/**
  * @brief  The minimum duration (LSb = 1/ODR) of the Interrupt 1 event to be
  *         recognized.[get]
  *

  * @param  val      change the values of d in reg INT1_DURATION
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_gen_duration_get( uint8_t* val )
{
    lis2de12_int1_duration_t int1_duration;
    int32_t                  ret;

    ret  = lis2de12_read_reg( LIS2DE12_INT1_DURATION, ( uint8_t* ) &int1_duration, 1 );
    *val = ( uint8_t ) int1_duration.d;

    return ret;
}

/**
 * @}
 *
 */

/**
 * @defgroup   LIS2DE12_Interrupts_generator_2
 * @brief      This section group all the functions that manage the second
 *             interrupts generator
 * @{
 *
 */

/**
  * @brief  Interrupt generator 2 configuration register.[set]
  *

  * @param  val      registers INT2_CFG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_gen_conf_set( lis2de12_int2_cfg_t* val )
{
    int32_t ret;
    ret = lis2de12_write_reg( LIS2DE12_INT2_CFG, ( uint8_t* ) val, 1 );
    return ret;
}

/**
  * @brief  Interrupt generator 2 configuration register.[get]
  *

  * @param  val      registers INT2_CFG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_gen_conf_get( lis2de12_int2_cfg_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_INT2_CFG, ( uint8_t* ) val, 1 );
    return ret;
}
/**
  * @brief  Interrupt generator 2 source register.[get]
  *

  * @param  val      registers INT2_SRC
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_gen_source_get( lis2de12_int2_src_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_INT2_SRC, ( uint8_t* ) val, 1 );
    return ret;
}
/**
  * @brief   User-defined threshold value for xl interrupt event on
  *          generator 2.[set]
  *          LSb = 16mg@2g / 32mg@4g / 62mg@8g / 186mg@16g
  *

  * @param  val      change the values of ths in reg INT2_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_gen_threshold_set( uint8_t val )
{
    lis2de12_int2_ths_t int2_ths;
    int32_t             ret;

    ret = lis2de12_read_reg( LIS2DE12_INT2_THS, ( uint8_t* ) &int2_ths, 1 );
    if( ret == 0 )
    {
        int2_ths.ths = val;
        ret          = lis2de12_write_reg( LIS2DE12_INT2_THS, ( uint8_t* ) &int2_ths, 1 );
    }
    return ret;
}

/**
  * @brief  User-defined threshold value for xl interrupt event on
  *         generator 2.[get]
  *         LSb = 16mg@2g / 32mg@4g / 62mg@8g / 186mg@16g
  *

  * @param  val      change the values of ths in reg INT2_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_gen_threshold_get( uint8_t* val )
{
    lis2de12_int2_ths_t int2_ths;
    int32_t             ret;

    ret  = lis2de12_read_reg( LIS2DE12_INT2_THS, ( uint8_t* ) &int2_ths, 1 );
    *val = ( uint8_t ) int2_ths.ths;

    return ret;
}

/**
  * @brief  The minimum duration (LSb = 1/ODR) of the Interrupt 1 event to be
  *         recognized .[set]
  *

  * @param  val      change the values of d in reg INT2_DURATION
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_gen_duration_set( uint8_t val )
{
    lis2de12_int2_duration_t int2_duration;
    int32_t                  ret;

    ret = lis2de12_read_reg( LIS2DE12_INT2_DURATION, ( uint8_t* ) &int2_duration, 1 );
    if( ret == 0 )
    {
        int2_duration.d = val;
        ret             = lis2de12_write_reg( LIS2DE12_INT2_DURATION, ( uint8_t* ) &int2_duration, 1 );
    }
    return ret;
}

/**
  * @brief  The minimum duration (LSb = 1/ODR) of the Interrupt 1 event to be
  *         recognized.[get]
  *

  * @param  val      change the values of d in reg INT2_DURATION
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_gen_duration_get( uint8_t* val )
{
    lis2de12_int2_duration_t int2_duration;
    int32_t                  ret;

    ret  = lis2de12_read_reg( LIS2DE12_INT2_DURATION, ( uint8_t* ) &int2_duration, 1 );
    *val = ( uint8_t ) int2_duration.d;

    return ret;
}

/**
 * @}
 *
 */

/**
 * @defgroup  LIS2DE12_Interrupt_pins
 * @brief     This section group all the functions that manage interrup pins
 * @{
 *
 */

/**
  * @brief  High-pass filter on interrupts/tap generator.[set]
  *

