enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
  * @param  val      change the values of hp in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_int_conf_set( lis2de12_hp_t val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    if( ret == 0 )
    {
        ctrl_reg2.hp = ( uint8_t ) val;
        ret          = lis2de12_write_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    }
    return ret;
}

/**
  * @brief  High-pass filter on interrupts/tap generator.[get]
  *

  * @param  val      Get the values of hp in reg CTRL_REG2
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_high_pass_int_conf_get( lis2de12_hp_t* val )
{
    lis2de12_ctrl_reg2_t ctrl_reg2;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG2, ( uint8_t* ) &ctrl_reg2, 1 );
    switch( ctrl_reg2.hp )
    {
    case LIS2DE12_DISC_FROM_INT_GENERATOR:
        *val = LIS2DE12_DISC_FROM_INT_GENERATOR;
        break;
    case LIS2DE12_ON_INT1_GEN:
        *val = LIS2DE12_ON_INT1_GEN;
        break;
    case LIS2DE12_ON_INT2_GEN:
        *val = LIS2DE12_ON_INT2_GEN;
        break;
    case LIS2DE12_ON_TAP_GEN:
        *val = LIS2DE12_ON_TAP_GEN;
        break;
    case LIS2DE12_ON_INT1_INT2_GEN:
        *val = LIS2DE12_ON_INT1_INT2_GEN;
        break;
    case LIS2DE12_ON_INT1_TAP_GEN:
        *val = LIS2DE12_ON_INT1_TAP_GEN;
        break;
    case LIS2DE12_ON_INT2_TAP_GEN:
        *val = LIS2DE12_ON_INT2_TAP_GEN;
        break;
    case LIS2DE12_ON_INT1_INT2_TAP_GEN:
        *val = LIS2DE12_ON_INT1_INT2_TAP_GEN;
        break;
    default:
        *val = LIS2DE12_DISC_FROM_INT_GENERATOR;
        break;
    }
    return ret;
}

/**
  * @brief  Int1 pin routing configuration register.[set]
  *

  * @param  val      registers CTRL_REG3
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_pin_int1_config_set( lis2de12_ctrl_reg3_t* val )
{
    int32_t ret;
    ret = lis2de12_write_reg( LIS2DE12_CTRL_REG3, ( uint8_t* ) val, 1 );
    return ret;
}

/**
  * @brief  Int1 pin routing configuration register.[get]
  *

  * @param  val      registers CTRL_REG3
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_pin_int1_config_get( lis2de12_ctrl_reg3_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG3, ( uint8_t* ) val, 1 );
    return ret;
}
/**
  * @brief  int2_pin_detect_4d: [set]  4D enable: 4D detection is enabled
  *                                    on INT2 pin when 6D bit on
  *                                    INT2_CFG (34h) is set to 1.
  *

  * @param  val      change the values of d4d_int2 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_pin_detect_4d_set( uint8_t val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    if( ret == 0 )
    {
        ctrl_reg5.d4d_int2 = val;
        ret                = lis2de12_write_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    }
    return ret;
}

/**
  * @brief  4D enable: 4D detection is enabled on INT2 pin when 6D bit on
  *         INT2_CFG (34h) is set to 1.[get]
  *

  * @param  val      change the values of d4d_int2 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_pin_detect_4d_get( uint8_t* val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret  = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    *val = ( uint8_t ) ctrl_reg5.d4d_int2;

    return ret;
}

/**
  * @brief   Latch interrupt request on INT2_SRC (35h) register, with
  *          INT2_SRC (35h) register cleared by reading INT2_SRC(35h)
  *          itself.[set]
  *

  * @param  val      change the values of lir_int2 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_pin_notification_mode_set( lis2de12_lir_int2_t val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    if( ret == 0 )
    {
        ctrl_reg5.lir_int2 = ( uint8_t ) val;
        ret                = lis2de12_write_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    }
    return ret;
}

/**
  * @brief   Latch interrupt request on INT2_SRC (35h) register, with
  *          INT2_SRC (35h) register cleared by reading INT2_SRC(35h)
  *          itself.[get]
  *

  * @param  val      Get the values of lir_int2 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int2_pin_notification_mode_get( lis2de12_lir_int2_t* val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    switch( ctrl_reg5.lir_int2 )
    {
    case LIS2DE12_INT2_PULSED:
        *val = LIS2DE12_INT2_PULSED;
        break;
    case LIS2DE12_INT2_LATCHED:
        *val = LIS2DE12_INT2_LATCHED;
        break;
    default:
        *val = LIS2DE12_INT2_PULSED;
        break;
    }
    return ret;
}

/**
  * @brief  4D enable: 4D detection is enabled on INT1 pin when 6D bit
  *                    on INT1_CFG(30h) is set to 1.[set]
  *

  * @param  val      change the values of d4d_int1 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_pin_detect_4d_set( uint8_t val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    if( ret == 0 )
    {
        ctrl_reg5.d4d_int1 = val;
        ret                = lis2de12_write_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    }
    return ret;
}

/**
  * @brief  4D enable: 4D detection is enabled on INT1 pin when 6D bit on
  *         INT1_CFG(30h) is set to 1.[get]
  *

  * @param  val      change the values of d4d_int1 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_pin_detect_4d_get( uint8_t* val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret  = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    *val = ( uint8_t ) ctrl_reg5.d4d_int1;

    return ret;
}

/**
  * @brief   Latch interrupt request on INT1_SRC (31h), with INT1_SRC(31h)
  *          register cleared by reading INT1_SRC (31h) itself.[set]
  *

