enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
  * @param  val      change the values of lir_int1 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_pin_notification_mode_set( lis2de12_lir_int1_t val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    if( ret == 0 )
    {
        ctrl_reg5.lir_int1 = ( uint8_t ) val;
        ret                = lis2de12_write_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    }
    return ret;
}

/**
  * @brief   Latch interrupt request on INT1_SRC (31h), with INT1_SRC(31h)
  *          register cleared by reading INT1_SRC (31h) itself.[get]
  *

  * @param  val      Get the values of lir_int1 in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_int1_pin_notification_mode_get( lis2de12_lir_int1_t* val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    switch( ctrl_reg5.lir_int1 )
    {
    case LIS2DE12_INT1_PULSED:
        *val = LIS2DE12_INT1_PULSED;
        break;
    case LIS2DE12_INT1_LATCHED:
        *val = LIS2DE12_INT1_LATCHED;
        break;
    default:
        *val = LIS2DE12_INT1_PULSED;
        break;
    }
    return ret;
}

/**
  * @brief  Int2 pin routing configuration register.[set]
  *

  * @param  val      registers CTRL_REG6
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_pin_int2_config_set( lis2de12_ctrl_reg6_t* val )
{
    int32_t ret;
    ret = lis2de12_write_reg( LIS2DE12_CTRL_REG6, ( uint8_t* ) val, 1 );
    return ret;
}

/**
  * @brief  Int2 pin routing configuration register.[get]
  *

  * @param  val      registers CTRL_REG6
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_pin_int2_config_get( lis2de12_ctrl_reg6_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG6, ( uint8_t* ) val, 1 );
    return ret;
}
/**
 * @}
 *
 */

/**
 * @defgroup  LIS2DE12_Fifo
 * @brief     This section group all the functions concerning the fifo usage
 * @{
 *
 */

/**
  * @brief  FIFO enable.[set]
  *

  * @param  val      change the values of fifo_en in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_set( uint8_t val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    if( ret == 0 )
    {
        ctrl_reg5.fifo_en = val;
        ret               = lis2de12_write_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    }
    return ret;
}

/**
  * @brief  FIFO enable.[get]
  *

  * @param  val      change the values of fifo_en in reg CTRL_REG5
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_get( uint8_t* val )
{
    lis2de12_ctrl_reg5_t ctrl_reg5;
    int32_t              ret;

    ret  = lis2de12_read_reg( LIS2DE12_CTRL_REG5, ( uint8_t* ) &ctrl_reg5, 1 );
    *val = ( uint8_t ) ctrl_reg5.fifo_en;

    return ret;
}

/**
  * @brief  FIFO watermark level selection.[set]
  *

  * @param  val      change the values of fth in reg FIFO_CTRL_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_watermark_set( uint8_t val )
{
    lis2de12_fifo_ctrl_reg_t fifo_ctrl_reg;
    int32_t                  ret;

    ret = lis2de12_read_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    if( ret == 0 )
    {
        fifo_ctrl_reg.fth = val;
        ret               = lis2de12_write_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    }
    return ret;
}

/**
  * @brief  FIFO watermark level selection.[get]
  *

  * @param  val      change the values of fth in reg FIFO_CTRL_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_watermark_get( uint8_t* val )
{
    lis2de12_fifo_ctrl_reg_t fifo_ctrl_reg;
    int32_t                  ret;

    ret  = lis2de12_read_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    *val = ( uint8_t ) fifo_ctrl_reg.fth;

    return ret;
}

/**
  * @brief  Trigger FIFO selection.[set]
  *

  * @param  val      change the values of tr in reg FIFO_CTRL_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_trigger_event_set( lis2de12_tr_t val )
{
    lis2de12_fifo_ctrl_reg_t fifo_ctrl_reg;
    int32_t                  ret;

    ret = lis2de12_read_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    if( ret == 0 )
    {
        fifo_ctrl_reg.tr = ( uint8_t ) val;
        ret              = lis2de12_write_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    }
    return ret;
}

/**
  * @brief  Trigger FIFO selection.[get]
  *

  * @param  val      Get the values of tr in reg FIFO_CTRL_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_trigger_event_get( lis2de12_tr_t* val )
{
    lis2de12_fifo_ctrl_reg_t fifo_ctrl_reg;
    int32_t                  ret;

    ret = lis2de12_read_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    switch( fifo_ctrl_reg.tr )
    {
    case LIS2DE12_INT1_GEN:
        *val = LIS2DE12_INT1_GEN;
        break;
    case LIS2DE12_INT2_GEN:
        *val = LIS2DE12_INT2_GEN;
        break;
    default:
        *val = LIS2DE12_INT1_GEN;
        break;
    }
    return ret;
}

/**
  * @brief  FIFO mode selection.[set]
  *

  * @param  val      change the values of fm in reg FIFO_CTRL_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_mode_set( lis2de12_fm_t val )
{
    lis2de12_fifo_ctrl_reg_t fifo_ctrl_reg;
    int32_t                  ret;

    ret = lis2de12_read_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    if( ret == 0 )
    {
        fifo_ctrl_reg.fm = ( uint8_t ) val;
        ret              = lis2de12_write_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    }
    return ret;
}

/**
  * @brief  FIFO mode selection.[get]
  *

  * @param  val      Get the values of fm in reg FIFO_CTRL_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_mode_get( lis2de12_fm_t* val )
{
    lis2de12_fifo_ctrl_reg_t fifo_ctrl_reg;
    int32_t                  ret;

    ret = lis2de12_read_reg( LIS2DE12_FIFO_CTRL_REG, ( uint8_t* ) &fifo_ctrl_reg, 1 );
    switch( fifo_ctrl_reg.fm )
    {
    case LIS2DE12_BYPASS_MODE:
        *val = LIS2DE12_BYPASS_MODE;
        break;
    case LIS2DE12_FIFO_MODE:
        *val = LIS2DE12_FIFO_MODE;
        break;
    case LIS2DE12_DYNAMIC_STREAM_MODE:
        *val = LIS2DE12_DYNAMIC_STREAM_MODE;
        break;
    case LIS2DE12_STREAM_TO_FIFO_MODE:
        *val = LIS2DE12_STREAM_TO_FIFO_MODE;
        break;
    default:
        *val = LIS2DE12_BYPASS_MODE;
        break;
    }
    return ret;
}

/**
  * @brief  FIFO status register.[get]
  *

  * @param  val      registers FIFO_SRC_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_status_get( lis2de12_fifo_src_reg_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_FIFO_SRC_REG, ( uint8_t* ) val, 1 );
    return ret;
}
/**
  * @brief  FIFO stored data level.[get]
  *

