enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
  * @param  val      change the values of fss in reg FIFO_SRC_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_data_level_get( uint8_t* val )
{
    lis2de12_fifo_src_reg_t fifo_src_reg;
    int32_t                 ret;

    ret  = lis2de12_read_reg( LIS2DE12_FIFO_SRC_REG, ( uint8_t* ) &fifo_src_reg, 1 );
    *val = ( uint8_t ) fifo_src_reg.fss;

    return ret;
}
/**
  * @brief  Empty FIFO status flag.[get]
  *

  * @param  val      change the values of empty in reg FIFO_SRC_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_empty_flag_get( uint8_t* val )
{
    lis2de12_fifo_src_reg_t fifo_src_reg;
    int32_t                 ret;

    ret  = lis2de12_read_reg( LIS2DE12_FIFO_SRC_REG, ( uint8_t* ) &fifo_src_reg, 1 );
    *val = ( uint8_t ) fifo_src_reg.empty;

    return ret;
}
/**
  * @brief  FIFO overrun status flag.[get]
  *

  * @param  val      change the values of ovrn_fifo in reg FIFO_SRC_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_ovr_flag_get( uint8_t* val )
{
    lis2de12_fifo_src_reg_t fifo_src_reg;
    int32_t                 ret;

    ret  = lis2de12_read_reg( LIS2DE12_FIFO_SRC_REG, ( uint8_t* ) &fifo_src_reg, 1 );
    *val = ( uint8_t ) fifo_src_reg.ovrn_fifo;

    return ret;
}
/**
  * @brief  FIFO watermark status.[get]
  *

  * @param  val      change the values of wtm in reg FIFO_SRC_REG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_fifo_fth_flag_get( uint8_t* val )
{
    lis2de12_fifo_src_reg_t fifo_src_reg;
    int32_t                 ret;

    ret  = lis2de12_read_reg( LIS2DE12_FIFO_SRC_REG, ( uint8_t* ) &fifo_src_reg, 1 );
    *val = ( uint8_t ) fifo_src_reg.wtm;

    return ret;
}
/**
 * @}
 *
 */

/**
 * @defgroup  LIS2DE12_Tap_generator
 * @brief     This section group all the functions that manage the tap and
 *            double tap event generation
 * @{
 *
 */

/**
  * @brief  Tap/Double Tap generator configuration register.[set]
  *

  * @param  val      registers CLICK_CFG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_tap_conf_set( lis2de12_click_cfg_t* val )
{
    int32_t ret;
    ret = lis2de12_write_reg( LIS2DE12_CLICK_CFG, ( uint8_t* ) val, 1 );
    return ret;
}

/**
  * @brief  Tap/Double Tap generator configuration register.[get]
  *

  * @param  val      registers CLICK_CFG
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_tap_conf_get( lis2de12_click_cfg_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_CLICK_CFG, ( uint8_t* ) val, 1 );
    return ret;
}
/**
  * @brief  Tap/Double Tap generator source register.[get]
  *

  * @param  val      registers CLICK_SRC
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_tap_source_get( lis2de12_click_src_t* val )
{
    int32_t ret;
    ret = lis2de12_read_reg( LIS2DE12_CLICK_SRC, ( uint8_t* ) val, 1 );
    return ret;
}
/**
  * @brief  User-defined threshold value for Tap/Double Tap event.[set]
  *         1 LSB = full scale/128
  *

  * @param  val      change the values of ths in reg CLICK_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_tap_threshold_set( uint8_t val )
{
    lis2de12_click_ths_t click_ths;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CLICK_THS, ( uint8_t* ) &click_ths, 1 );
    if( ret == 0 )
    {
        click_ths.ths = val;
        ret           = lis2de12_write_reg( LIS2DE12_CLICK_THS, ( uint8_t* ) &click_ths, 1 );
    }
    return ret;
}

/**
  * @brief  User-defined threshold value for Tap/Double Tap event.[get]
  *         1 LSB = full scale/128
  *

  * @param  val      change the values of ths in reg CLICK_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_tap_threshold_get( uint8_t* val )
{
    lis2de12_click_ths_t click_ths;
    int32_t              ret;

    ret  = lis2de12_read_reg( LIS2DE12_CLICK_THS, ( uint8_t* ) &click_ths, 1 );
    *val = ( uint8_t ) click_ths.ths;

    return ret;
}

/**
  * @brief   If the LIR_Click bit is not set, the interrupt is kept high
  *          for the duration of the latency window.
  *          If the LIR_Click bit is set, the interrupt is kept high until the
  *          CLICK_SRC(39h) register is read.[set]
  *

  * @param  val      change the values of lir_click in reg CLICK_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_tap_notification_mode_set( lis2de12_lir_click_t val )
{
    lis2de12_click_ths_t click_ths;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CLICK_THS, ( uint8_t* ) &click_ths, 1 );
    if( ret == 0 )
    {
        click_ths.lir_click = ( uint8_t ) val;
        ret                 = lis2de12_write_reg( LIS2DE12_CLICK_THS, ( uint8_t* ) &click_ths, 1 );
    }
    return ret;
}

/**
  * @brief   If the LIR_Click bit is not set, the interrupt is kept high
  *          for the duration of the latency window.
  *          If the LIR_Click bit is set, the interrupt is kept high until the
  *          CLICK_SRC(39h) register is read.[get]
  *

  * @param  val      Get the values of lir_click in reg CLICK_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_tap_notification_mode_get( lis2de12_lir_click_t* val )
{
    lis2de12_click_ths_t click_ths;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CLICK_THS, ( uint8_t* ) &click_ths, 1 );
    switch( click_ths.lir_click )
    {
    case LIS2DE12_TAP_PULSED:
        *val = LIS2DE12_TAP_PULSED;
        break;
    case LIS2DE12_TAP_LATCHED:
        *val = LIS2DE12_TAP_LATCHED;
        break;
    default:
        *val = LIS2DE12_TAP_PULSED;
        break;
    }
    return ret;
}

/**
  * @brief  The maximum time (1 LSB = 1/ODR) interval that can elapse
  *         between the start of the click-detection procedure and when the
  *         acceleration falls back below the threshold.[set]
  *

