enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
  * @param  val      change the values of tli in reg TIME_LIMIT
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_shock_dur_set( uint8_t val )
{
    lis2de12_time_limit_t time_limit;
    int32_t               ret;

    ret = lis2de12_read_reg( LIS2DE12_TIME_LIMIT, ( uint8_t* ) &time_limit, 1 );
    if( ret == 0 )
    {
        time_limit.tli = val;
        ret            = lis2de12_write_reg( LIS2DE12_TIME_LIMIT, ( uint8_t* ) &time_limit, 1 );
    }
    return ret;
}

/**
  * @brief  The maximum time (1 LSB = 1/ODR) interval that can elapse between
  *         the start of the click-detection procedure and when the
  *         acceleration falls back below the threshold.[get]
  *

  * @param  val      change the values of tli in reg TIME_LIMIT
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_shock_dur_get( uint8_t* val )
{
    lis2de12_time_limit_t time_limit;
    int32_t               ret;

    ret  = lis2de12_read_reg( LIS2DE12_TIME_LIMIT, ( uint8_t* ) &time_limit, 1 );
    *val = ( uint8_t ) time_limit.tli;

    return ret;
}

/**
  * @brief  The time (1 LSB = 1/ODR) interval that starts after the first
  *         click detection where the click-detection procedure is
  *         disabled, in cases where the device is configured for
  *         double-click detection.[set]
  *

  * @param  val      change the values of tla in reg TIME_LATENCY
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_quiet_dur_set( uint8_t val )
{
    lis2de12_time_latency_t time_latency;
    int32_t                 ret;

    ret = lis2de12_read_reg( LIS2DE12_TIME_LATENCY, ( uint8_t* ) &time_latency, 1 );
    if( ret == 0 )
    {
        time_latency.tla = val;
        ret              = lis2de12_write_reg( LIS2DE12_TIME_LATENCY, ( uint8_t* ) &time_latency, 1 );
    }
    return ret;
}

/**
  * @brief  The time (1 LSB = 1/ODR) interval that starts after the first
  *         click detection where the click-detection procedure is
  *         disabled, in cases where the device is configured for
  *         double-click detection.[get]
  *

  * @param  val      change the values of tla in reg TIME_LATENCY
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_quiet_dur_get( uint8_t* val )
{
    lis2de12_time_latency_t time_latency;
    int32_t                 ret;

    ret  = lis2de12_read_reg( LIS2DE12_TIME_LATENCY, ( uint8_t* ) &time_latency, 1 );
    *val = ( uint8_t ) time_latency.tla;

    return ret;
}

/**
  * @brief  The maximum interval of time (1 LSB = 1/ODR) that can elapse
  *         after the end of the latency interval in which the click-detection
  *         procedure can start, in cases where the device is configured
  *         for double-click detection.[set]
  *

  * @param  val      change the values of tw in reg TIME_WINDOW
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_double_tap_timeout_set( uint8_t val )
{
    lis2de12_time_window_t time_window;
    int32_t                ret;

    ret = lis2de12_read_reg( LIS2DE12_TIME_WINDOW, ( uint8_t* ) &time_window, 1 );
    if( ret == 0 )
    {
        time_window.tw = val;
        ret            = lis2de12_write_reg( LIS2DE12_TIME_WINDOW, ( uint8_t* ) &time_window, 1 );
    }
    return ret;
}

/**
  * @brief  The maximum interval of time (1 LSB = 1/ODR) that can elapse
  *         after the end of the latency interval in which the
  *         click-detection procedure can start, in cases where the device
  *         is configured for double-click detection.[get]
  *

  * @param  val      change the values of tw in reg TIME_WINDOW
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_double_tap_timeout_get( uint8_t* val )
{
    lis2de12_time_window_t time_window;
    int32_t                ret;

    ret  = lis2de12_read_reg( LIS2DE12_TIME_WINDOW, ( uint8_t* ) &time_window, 1 );
    *val = ( uint8_t ) time_window.tw;

    return ret;
}

/**
 * @}
 *
 */

/**
 * @defgroup  LIS2DE12_Activity_inactivity
 * @brief     This section group all the functions concerning activity
 *            inactivity functionality
 * @{
 *
 */

/**
  * @brief    Sleep-to-wake, return-to-sleep activation threshold in
  *           low-power mode.[set]
  *           1 LSb = 16mg@2g / 32mg@4g / 62mg@8g / 186mg@16g
  *

  * @param  val      change the values of acth in reg ACT_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_act_threshold_set( uint8_t val )
{
    lis2de12_act_ths_t act_ths;
    int32_t            ret;

    ret = lis2de12_read_reg( LIS2DE12_ACT_THS, ( uint8_t* ) &act_ths, 1 );
    if( ret == 0 )
    {
        act_ths.acth = val;
        ret          = lis2de12_write_reg( LIS2DE12_ACT_THS, ( uint8_t* ) &act_ths, 1 );
    }
    return ret;
}

/**
  * @brief  Sleep-to-wake, return-to-sleep activation threshold in low-power
  *         mode.[get]
  *         1 LSb = 16mg@2g / 32mg@4g / 62mg@8g / 186mg@16g
  *

  * @param  val      change the values of acth in reg ACT_THS
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_act_threshold_get( uint8_t* val )
{
    lis2de12_act_ths_t act_ths;
    int32_t            ret;

    ret  = lis2de12_read_reg( LIS2DE12_ACT_THS, ( uint8_t* ) &act_ths, 1 );
    *val = ( uint8_t ) act_ths.acth;

    return ret;
}

/**
  * @brief  Sleep-to-wake, return-to-sleep.[set]
  *         duration = (8*1[LSb]+1)/ODR
  *

  * @param  val      change the values of actd in reg ACT_DUR
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_act_timeout_set( uint8_t val )
{
    lis2de12_act_dur_t act_dur;
    int32_t            ret;

    ret = lis2de12_read_reg( LIS2DE12_ACT_DUR, ( uint8_t* ) &act_dur, 1 );
    if( ret == 0 )
    {
        act_dur.actd = val;
        ret          = lis2de12_write_reg( LIS2DE12_ACT_DUR, ( uint8_t* ) &act_dur, 1 );
    }
    return ret;
}

/**
  * @brief  Sleep-to-wake, return-to-sleep.[get]
  *         duration = (8*1[LSb]+1)/ODR
  *

  * @param  val      change the values of actd in reg ACT_DUR
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_act_timeout_get( uint8_t* val )
{
    lis2de12_act_dur_t act_dur;
    int32_t            ret;

    ret  = lis2de12_read_reg( LIS2DE12_ACT_DUR, ( uint8_t* ) &act_dur, 1 );
    *val = ( uint8_t ) act_dur.actd;

    return ret;
}

/**
 * @}
 *
 */

/**
 * @defgroup  LIS2DE12_Serial_interface
 * @brief     This section group all the functions concerning serial
 *            interface management
 * @{
 *
 */

/**
  * @brief  Connect/Disconnect SDO/SA0 internal pull-up.[set]
  *

  * @param  val      change the values of sdo_pu_disc in reg CTRL_REG0
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_pin_sdo_sa0_mode_set( lis2de12_sdo_pu_disc_t val )
{
    lis2de12_ctrl_reg0_t ctrl_reg0;
    int32_t              ret;

