enisyuksel/Farm-Tracking-System/STM32CubeIDE/Application/User/Core/lis2de12.c
    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG0, ( uint8_t* ) &ctrl_reg0, 1 );
    if( ret == 0 )
    {
        ctrl_reg0.sdo_pu_disc = ( uint8_t ) val;
        ret                   = lis2de12_write_reg( LIS2DE12_CTRL_REG0, ( uint8_t* ) &ctrl_reg0, 1 );
    }
    return ret;
}

/**
  * @brief  Connect/Disconnect SDO/SA0 internal pull-up.[get]
  *

  * @param  val      Get the values of sdo_pu_disc in reg CTRL_REG0
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_pin_sdo_sa0_mode_get( lis2de12_sdo_pu_disc_t* val )
{
    lis2de12_ctrl_reg0_t ctrl_reg0;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG0, ( uint8_t* ) &ctrl_reg0, 1 );
    switch( ctrl_reg0.sdo_pu_disc )
    {
    case LIS2DE12_PULL_UP_DISCONNECT:
        *val = LIS2DE12_PULL_UP_DISCONNECT;
        break;
    case LIS2DE12_PULL_UP_CONNECT:
        *val = LIS2DE12_PULL_UP_CONNECT;
        break;
    default:
        *val = LIS2DE12_PULL_UP_DISCONNECT;
        break;
    }
    return ret;
}

/**
  * @brief  SPI Serial Interface Mode selection.[set]
  *

  * @param  val      change the values of sim in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_spi_mode_set( lis2de12_sim_t val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    if( ret == 0 )
    {
        ctrl_reg4.sim = ( uint8_t ) val;
        ret           = lis2de12_write_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    }
    return ret;
}

/**
  * @brief  SPI Serial Interface Mode selection.[get]
  *

  * @param  val      Get the values of sim in reg CTRL_REG4
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lis2de12_spi_mode_get( lis2de12_sim_t* val )
{
    lis2de12_ctrl_reg4_t ctrl_reg4;
    int32_t              ret;

    ret = lis2de12_read_reg( LIS2DE12_CTRL_REG4, ( uint8_t* ) &ctrl_reg4, 1 );
    switch( ctrl_reg4.sim )
    {
    case LIS2DE12_SPI_4_WIRE:
        *val = LIS2DE12_SPI_4_WIRE;
        break;
    case LIS2DE12_SPI_3_WIRE:
        *val = LIS2DE12_SPI_3_WIRE;
        break;
    default:
        *val = LIS2DE12_SPI_4_WIRE;
        break;
    }
    return ret;
}

/***************************************************************************\
 * Local Function Definition
\***************************************************************************/

//static void accelerometer_irq1_init( void ) {
//    hal_gpio_init_in( lis2de12_int1.pin, BSP_GPIO_PULL_MODE_NONE, BSP_GPIO_IRQ_MODE_RISING, &lis2de12_int1 );
//}

void lis2de12_int1_irq_handler( void* obj ) {
    accelerometer_irq1_state = true;
}

int32_t hal_i2c_read_buffer(uint8_t id, uint8_t device_addr, uint8_t reg_addr, uint8_t* data, uint16_t len)
{
    HAL_StatusTypeDef status;
    status = HAL_I2C_Mem_Read(&hi2c3, device_addr, reg_addr, I2C_MEMADD_SIZE_8BIT, data, len, HAL_MAX_DELAY);
    return (status == HAL_OK) ? 0 : 1;
}

int32_t hal_i2c_write_buffer(uint8_t id, uint8_t device_addr, uint8_t reg_addr, uint8_t* data, uint16_t len)
{
    HAL_StatusTypeDef status;
    status = HAL_I2C_Mem_Write(&hi2c3, device_addr, reg_addr, I2C_MEMADD_SIZE_8BIT, data, len, HAL_MAX_DELAY);
    return (status == HAL_OK) ? 0 : 1;
}

